# Trabalhando com o Pandas em manipulação de dados

## Introdução

*O pandas é uma biblioteca extremamente útil quando se fala na análise de dados e machine learning, principalmente quando esses dados estão no patamar de centenas ou milhares de linhas. Neste pequeno Notebook, você  irá  aprender  a  desenvolver   algumas funções básicas, entretanto fundamentais    para a manipulação das colunas e o tratamento de dados, bem como formas de pesquisa na sua base de dados, podendo assim, fazer programas de busca em uma base de dados muito grande, aproveite.*

In [13]:
import pandas as pd
data = pd.read_csv('athlete_events.csv')  #importando dados

In [15]:
data.head(5) #exibindo os 5 primeiros elementos(n) do dataset -> data.head(n)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [47]:
data.describe()   #descrição de informacoes do dataset
                  #count = quantidade; mean = media; std = desvio padrao; min = minimo; max = maximo; percentil, 25,50 e 75

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [43]:
#criando  seu proprio data frame pelo pandas:

alunos = {'Nome':['Pedro', 'João','Ricardo', 'Elton', 'Lucas'],
         'Nota':['8','6','7.8','10','5.8'],
         'Situação':['Aprovado','Reprovado','Aprovado','Aprovado','Reprovado']}   #criação de um dicionario

In [44]:
dataframe = pd.DataFrame(alunos) #transformando o dicionario em um dataframe do pandas
dataframe.head() #exibindo o dataframe criado:

      Nome Nota   Situação
0    Pedro    8   Aprovado
1     João    6  Reprovado
2  Ricardo  7.8   Aprovado
3    Elton   10   Aprovado
4    Lucas  5.8  Reprovado

In [45]:
dataframe.shape #exibindo o tamanho  (dimensões)  do conjunto de dados

(5, 3)

In [56]:
dataframe['Nome']    #filtrando a coluna n (nome) -> dataframe[n] onde n pode ser qualquer coluna do dataset

0      Pedro
1       João
2    Ricardo
3      Elton
4      Lucas
Name: Nome, dtype: object

In [57]:
dataframe.loc[[0]] #comando loc, usado para separar linhas de um dataframe -> dataframe.loc[[n]] , onde n é a linha do dataset

    Nome Nota  Situação
0  Pedro    8  Aprovado

In [59]:
dataframe.loc[[0,2,3]]  #também é possivel separar mais de uma linha (ex: separação de todos os alunos aprovados)

      Nome Nota  Situação
0    Pedro    8  Aprovado
2  Ricardo  7.8  Aprovado
3    Elton   10  Aprovado

In [62]:
dataframe.loc[1:3]  #filtrando as linhas por um intervalo -> [n inicial:n final], n = numero da linha (indice)

      Nome Nota   Situação
1     João    6  Reprovado
2  Ricardo  7.8   Aprovado
3    Elton   10   Aprovado

In [63]:
dataframe.loc[dataframe["Nome"]=='Pedro'] #pesquisando no dataset através de um nome em uma coluna especifica

    Nome Nota  Situação
0  Pedro    8  Aprovado

In [70]:
pesquisa = input("Insira o Nome para a busca no dataset:\n")  #solicitando ao usuário um nome para a busca no dataset

dataframe.loc[dataframe["Nome"]==pesquisa]  #comando de pesquisa na coluna  de Nome

Insira o Nome para a busca no dataset:
Ricardo

      Nome Nota  Situação
2  Ricardo  7.8  Aprovado

In [73]:
pesquisa2 = input("Insira a sua busca:\n")  #solicitando ao usuário a busca no dataset

dataframe.loc[dataframe["Situação"]==pesquisa2] #buscando todos os alunos reprovados/aprovados

Insira a sua busca:
Aprovado

      Nome Nota  Situação
0    Pedro    8  Aprovado
2  Ricardo  7.8  Aprovado
3    Elton   10  Aprovado